brianwyld/ble_nrf52_v2/includes/board_ms50SFA2_w_ble.h
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */
#ifndef BOARD_MS50SFA2_W_BLE_H
#define BOARD_MS50SFA2_W_BLE_H

#ifdef __cplusplus
extern "C" {
#endif

#include "nrf_gpio.h"

// numbers are pin numbers on nRF52832 QFN48
// LEDs definitions for Minew module MS50SFA2 on a wyres BLE board
#define LEDS_NUMBER    2

#define LED_START      5
#define LED_1          5    // CN4/p9
#define LED_2          6    // CN4/p10
#define LED_3          255
#define LED_4          255
#define LED_STOP       6

#define LEDS_ACTIVE_STATE 0

#define LEDS_LIST { LED_1, LED_2 }

#define LEDS_INV_MASK  LEDS_MASK

#define BSP_LED_0      LED_1
#define BSP_LED_1      LED_2
#define BSP_LED_2      LED_3
#define BSP_LED_3      LED_4

#define BUTTONS_NUMBER 1

#define BUTTON_START   24
#define BUTTON_1       24       // CN4/P4
#define BUTTON_2       255
#define BUTTON_3       255
#define BUTTON_4       255
#define BUTTON_STOP    24
#define BUTTON_PULL    NRF_GPIO_PIN_PULLUP

#define BUTTONS_ACTIVE_STATE 0

#define BUTTONS_LIST { BUTTON_1, BUTTON_2, BUTTON_3, BUTTON_4 }

#define BSP_BUTTON_0   BUTTON_1
#define BSP_BUTTON_1   BUTTON_2
#define BSP_BUTTON_2   BUTTON_3
#define BSP_BUTTON_3   BUTTON_4
// CN4/p1
#define BSP_VCCUART     39  
// CN4/p3
#define BSP_EXT_IO      40  
// CN1/p4
#define RX_PIN_NUMBER  21   
// CN1/p3
#define TX_PIN_NUMBER  20   
#define CTS_PIN_NUMBER UART_PIN_DISCONNECTED
#define RTS_PIN_NUMBER UART_PIN_DISCONNECTED
#define HWFC           false

// I2C
#define I2C_ENABLED 1
// CN3/p4
#define I2C_CONFIG_SCL_PIN 15
// CN3/p3
#define I2C_CONFIG_SDA_PIN 14

// I2S
#undef I2S_ENABLED
#undef I2S_CONFIG_SCK_PIN
#undef I2S_CONFIG_LRCK_PIN
#undef I2S_CONFIG_SDOUT_PIN
#undef I2S_CONFIG_MCK_PIN
#undef I2S_CONFIG_SDIN_PIN
#define I2S_ENABLED 1
// CN4/p7
#define I2S_CONFIG_SCK_PIN 12
// CN4/p8
#define I2S_CONFIG_LRCK_PIN 11
// CN4/p5
#define I2S_CONFIG_SDOUT_PIN 41
#define I2S_CONFIG_MCK_PIN 255
#define I2S_CONFIG_SDIN_PIN 255

// Low frequency clock source to be used by the SoftDevice
#ifdef S210
#define NRF_CLOCK_LFCLKSRC      NRF_CLOCK_LFCLKSRC_XTAL_20_PPM
#else
#define NRF_CLOCK_LFCLKSRC      {.source        = NRF_CLOCK_LF_SRC_XTAL,            \
                                 .rc_ctiv       = 0,                                \
                                 .rc_temp_ctiv  = 0,                                \
                                 .xtal_accuracy = NRF_CLOCK_LF_XTAL_ACCURACY_20_PPM}
#endif

#ifdef __cplusplus
}
#endif

#endif // BOARD_MS50SFA2_W_BLE_H
